Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (75) There is the meditative stability named Endowed with the Factors Conducive to Enlightenment.

source: སྤོབས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (76) There is the meditative stability named Boundless Inspiration.

source: མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (77) There is the meditative stability named Equal to the Unequaled.

source: ཐམས་ཅད་ལས་འདའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (78) There is the meditative stability named Transcending All Things.

source: ཤིན་ཏུ་བརྟགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (79) There is the meditative stability named Utterly Devoid of Delimitation.

source: ནེམ་ནུར་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (80) There is the meditative stability named Dispelling of Doubt.

source: གནས་སུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (81) There is the meditative stability named Without Settled Focus.

source: བཀོད་པ་གཅིག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (82) There is the meditative stability named Single Array.

source: རྣམ་པ་མངོན་པར་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (83) There is the meditative stability named Manifest Attainment of Modalities.

source: རྣམ་པ་གཅིག་ཏུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (84) There is the meditative stability named Unity of Aspects.

source: རྣམ་པ་དོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (85) There is the meditative stability named Non-dispersion of Aspects.

source: སྲིད་པའི་འདམ་བུ་ཐམས་ཅད་ཕུང་པོ་མེད་པར་རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (86) There is the meditative stability named [Comprehension of/] Dispersal of All Bases of Rebirth [through Realization].

source: བརྡ་དང་སྒྲ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (87) There is the meditative stability named Entrance to Symbols and Sounds.

source: སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (88) There is the meditative stability named Devoid of Vocalic Syllables.

source: སྒྲོན་མ་འབར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (89) There is the meditative stability named Burning Lamp.

source: མཚན་ཉིད་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (90) There is the meditative stability named Purification of Defining Characteristics.

source: མངོན་པར་མི་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (91) There is the meditative stability named Manifestly Imperceptible.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (92) There is the meditative stability named Endowed with All Finest Aspects.

source: བདེ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (93) There is the meditative stability named Absence of Joy with Respect to All Happiness and Suffering.

source: རྣམ་པ་ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (94) There is the meditative stability named Inexhaustible Cornucopia.

source: གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (95) There is the meditative stability named Retentive Intelligence.

source: ཡང་དག་པ་དང་ལོག་པ་ཐམས་ཅད་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (96) There is the meditative stability named Complete Elimination of Right and Wrong.

source: སྒྲ་བསྒྲགས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (97) There is the meditative stability named Imbued with Resonance.

source: འགལ་བ་དང་འགོག་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (98) There is the meditative stability named Appeasing of All Deviations and Obstacles.

source: སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (100) There is the meditative stability named Endowed with the Essence.

source: ཟླ་བ་ཉ་བའི་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (101) There is the meditative stability named Taintless Light of the Full Moon.

source: བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (102) There is the meditative stability named Great Array [/Ornament].

source: འཇིག་རྟེན་ཐམས་ཅད་ལ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (103) There is the meditative stability named Illuminator of All Worlds.

source: ཏིང་ངེ་འཛིན་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (104) There is the meditative stability named Sameness of Meditative Stability.

source: རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (105) There is the meditative stability named Taintless Modality Devoid of Impurities.

source: ཉོན་མོངས་པ་མེད་པ་དང་། ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (106) There is the meditative stability named Convergence of All Mental Afflictions in Non-affliction.

source: གཡོ་བ་མེད་ཅིང་གནས་པ་མེད་ལ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (107) There is the meditative stability named Engaging Without Wavering and Without Settled Focus.

source: དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (108) There is the meditative stability named Abiding in the Real Nature Without Mentation.

source: ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (109) There is the meditative stability named Dispelling the Misery of Corporeality.

source: ངག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (110) There is the meditative stability named Obliterating Defects of Speech, Transforming Them as if into Space.

source: ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་ལ་རྣམ་པར་གྲོལ་བ་ལས་རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: And, (111) there is the meditative stability named Unattached, Liberated, and Uncovered like Space.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གང་དག་ལ་གནས་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་དེ་དག་ཡིན་ནོ། །
en: “Venerable Śāradvatī­putra, these are the meditative stabilities of great bodhisattva beings, abiding in which they will swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then, the venerable Su­bhūti said to the venerable Śāradvatī­putra, “O Venerable Śāradvatī­putra!

source: ཨ་ལ་ལ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཏིང་ངེ་འཛིན་འདི་དག་ལ་གནས་པ་དེ་ནི། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་ལ།
en: The tathāgatas, arhats, genuinely perfect buddhas of the past have foreordained that great bodhisattva beings who abide in these abovementioned meditative stabilities will attain unsurpassed and genuinely perfect enlightenment.

source: ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་དག་འཚོ་ཞིང་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ལུང་སྟོན་པར་རིག་པར་བྱ་སྟེ།
en: One should know that the tathāgatas, arhats, genuinely perfect buddhas who are presently alive, residing in the world systems of the ten directions, numerous as the sands of the River Ganges, also make prophecies with regard to those great bodhisattva beings.

source: ཏིང་ངེ་འཛིན་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་སྙོམས་པར་མ་ཞུགས་པ་དག་གོ། །
en: “Without considering any of those meditative stabilities, these bodhisattvas are absorbed in meditation.

source: བདག་ནི་སྙོམས་པར་ཞུགས་པའོ། །
en: They do not make assumptions on account of those meditative stabilities, thinking, ‘I have been absorbed in meditation.

source: སྙོམས་པར་འཇུག་གོ། །
en: I am absorbed in meditation.

source: སྙོམས་པར་འཇུག་པར་འགྱུར་རོ་སྙམ་དུ་ཏིང་ངེ་འཛིན་དེ་དག་གིས་རློམ་སེམས་སུ་ཡང་མི་བྱེད་ལ།
en: I will be absorbed in meditation.’

source: རྣམ་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་དེ་ལ་མེད་ཅིང་མི་འབྱུང་ངོ་། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: All these conceptual imaginations are absent and do not arise.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། ད་ལྟར་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། དེ་བཞིན་གཤེགས་པ་གང་དག་འཚོ་ཞིང་བཞུགས་པ་དག་གིས་ལུང་བསྟན་པར་རིག་པར་བྱའམ།
en: Then, the venerable Śāradvatī­putra said to the venerable Su­bhūti, “Venerable Su­bhūti, should one then know that great bodhisattva beings who abide in these meditative stabilities have been foreordained by the tathāgatas of the past and are being foreordained by the tathāgatas who are alive at present, residing in the world systems of the ten directions, numerous as the sands of the River Ganges?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་ཡིན་ནོ། །
en: “Venerable Śāradvatī­putra, that is not the case!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཞན་ཞིང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱང་གཞན་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་གཞན་མ་ཡིན་གྱི།
en: If you ask why, it is because, Venerable Śāradvatī­putra, the transcendent perfection of wisdom, the meditative stabilities, and great bodhisattva beings are not distinct from one another.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཡིན་ལ། ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Rather, the bodhisattvas themselves are the meditative stabilities, and the meditative stabilities are themselves the bodhisattvas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་དབྱེར་མེད་པའི་ཕྱིར་རོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་ཏིང་ངེ་འཛིན་ཀྱང་གཞན་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན་ཏེ། ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཡིན།
en: The bodhisattvas, the meditative stabilities, and this transcendent perfection of wisdom are without duality, and they are inseparable.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཡིན་ལ། ཏིང་ངེ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེ་གཉིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ན་ནི། དེ་ལྟ་ན་ཏིང་ངེ་འཛིན་གྱིས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མི་ཤེས་ཤིང་། ཀུན་ཏུ་ཤེས་པ་མེད་པར་ཡང་འགྱུར་རོ། །
en: “Venerable Su­bhūti, if the meditative stabilities and the bodhisattvas are not distinct from one another, and if the meditative stabilities are themselves the bodhisattvas, and the bodhisattvas are themselves the meditative stabilities, and if both the meditative stabilities and the bodhisattvas are the transcendent perfection of wisdom, then they will not know through their meditative stabilities that all things are sameness, nor will they have any cognition.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་འདི་ཉིད་ཀྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་དེས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དེ་མི་ཤེས་ཤིང་། ཀུན་ཏུ་ཤེས་པ་ཡང་མེད་དོ། །
en: “Venerable Śāradvatī­putra, for these reasons great bodhisattva beings do not know through their meditative stability that all things are sameness, nor do they have any cognition.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དང་། ཏིང་ངེ་འཛིན་དེ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་མི་ཤེས་ཤིང་ཀུན་ཏུ་ཤེས་པ་ཡང་མེད་དོ། །
en: If you ask why,” he continued, “it is owing to the non-existence of that bodhisattva, that meditative stability, and that transcendent perfection of wisdom that they do not know, and indeed that they have no cognition.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ། །
en: Then the Reverend Lord congratulated the venerable Su­bhūti, saying, “Well said, Su­bhūti!

source: ཁྱོད་ཀྱིས་ཚིག་འདི་ནི་ལེགས་པར་སྨྲས་སོ། །
en: Well said!

source: འདི་ལྟར་ཁྱོད་ངས་ཉན་ཐོས་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་ལ་ལུང་ཕོག་པ་འདི་ནི་ཁྱོད་ཀྱི་ཚུལ་དང་འཐུན་པ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱ།
en: You whom I have declared to be supreme among śrāvakas abiding free from afflicted mental states, you have spoken these words well!

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: In conformity with your approach, great bodhisattva beings should indeed train in the transcendent perfection of wisdom, and they should train accordingly in the transcendent perfection of meditative concentration, in the transcendent perfection of perseverance, in the transcendent perfection of tolerance, in the transcendent perfection of ethical discipline, and in the transcendent perfection of generosity.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་དེ་ལྟར་བསླབ་པར་བྱ་བ་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: Similarly, they should train in the applications of mindfulness, and [in the other causal attributes], up to and including the noble eightfold path, and in the ten powers of the tathāgatas, and in the same vein, in [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སློབ་པ་ལགས་སམ།
en: Then the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, when great bodhisattva beings train accordingly, do they train in the transcendent perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སློབ་པ་ཡིན་ཏེ།
en: The Reverend Lord replied, “Śāradvatī­putra, when great bodhisattva beings train accordingly, they do train in the transcendent perfection of wisdom.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་བོ། །
en: In doing so, they train without apprehending anything.

source: དེ་བཞིན་དུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ལ་སློབ་པ་ཡིན་ཞིང་།
en: It is in the same manner that they train in the [other transcendent perfections], from the transcendent perfection of generosity onwards.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ལྟར་སློབ་ན་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་བར་ལ་སློབ་པ་ཡིན་པ་ནས། དེ་ལྟར་སློབ་ན་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་སློབ་པ་ཡིན་ཏེ།
en: In the same vein, when they train accordingly, they also train in the [causal attributes], from the applications of mindfulness onwards, and when they train accordingly, they also train in the [fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སློབ་པ་ལགས་ཤིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ལགས་སམ།
en: Then, the venerable Śāradvatī­putra asked the Reverend Lord, “Reverend Lord, so is it the case that when great bodhisattva beings train accordingly, they train in the transcendent perfection of wisdom, and in doing so, that they train without apprehending anything?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན་ནོ། །
en: The Reverend Lord replied, “Śāradvatī­putra, when great bodhisattva beings train accordingly, they do indeed train in the transcendent perfection of wisdom, without apprehending anything.”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་ཞིག་མི་དམིགས་ལགས།
en: Then he asked, “Reverend Lord, what is it that they do not apprehend?”

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས་པ་ནས།
en: They do not apprehend sentient beings, and so on.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་མི་དམིགས་སོ། །
en: They do not apprehend knowers and viewers.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཕུང་པོ་རྣམས་མི་དམིགས།
en: Similarly, owing to the utter purity of all things, they do not apprehend the psycho-physical aggregates.

source: ཁམས་རྣམས་མི་དམིགས།
en: They do not apprehend the sensory elements.

source: སྐྱེ་མཆེད་རྣམས་མི་དམིགས་སོ། །
en: They do not apprehend the sense fields.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་མ་རིག་པ་མི་དམིགས་པ་ནས། རྒ་ཤིའི་བར་དུ་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend fundamental ignorance, and they do not apprehend [the other links of dependent origination], up to and including aging and death.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་སྡུག་བསྔལ་མི་དམིགས། ཀུན་འབྱུང་བ་དང་།
en: Similarly, owing to the utter purity of all things, they do not apprehend [the truth of] suffering.

source: འགོག་པ་དང་། ལམ་མི་དམིགས་སོ། །
en: Nor do they apprehend [the truths of] the origin of suffering, the cessation of suffering, and the path that leads to it.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་འདོད་པའི་ཁམས་མི་དམིགས། གཟུགས་ཀྱི་ཁམས་མི་དམིགས། གཟུགས་མེད་པའི་ཁམས་མི་དམིགས་སོ། །
en: Similarly, owing to the utter purity of all things, they do not apprehend the world system of desire; nor do they apprehend the world system of form and nor do they apprehend the world system of formlessness.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་པ་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་མི་དམིགས་སོ། །
en: Similarly, owing to the utter purity of all things, they do not apprehend the applications of mindfulness, and they do not apprehend [the other causal attributes], up to and including the noble eightfold path.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་མི་དམིགས་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་མི་དམིགས་སོ། །
en: Similarly, owing to the utter purity of all things, they do not apprehend the ten powers of the tathāgatas, and they do not apprehend [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend the six transcendent perfections.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར། རྒྱུན་དུ་ཞུགས་པ་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend those entering the stream.

source: དེ་བཞིན་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend those who are tied to one more rebirth, those who will not be reborn, and those who have attained arhatship.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རང་སངས་རྒྱས་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend pratyekabuddhas.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend bodhisattvas.

source: ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ། །
en: Owing to the utter purity of all things, they do not apprehend tathāgatas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་དེ་གང་ལགས།
en: Then the venerable Śāradvatī­putra asked the Reverend Lord, “Reverend Lord, what is that purity?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་།
en: The Blessed One replied, “Purity indicates that all things are non-arising.

source: དེ་བཞིན་དུ་འགག་པ་མེད་པ་དང་།
en: Similarly, they are unceasing.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་།
en: They are neither afflicted nor are they purified.

source: འབྱུང་བ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དེ་ནི་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: They do not arise, and they are without apprehension—all things are unconditioned.”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ན་ཆོས་གང་དག་ལ་བསླབས་པ་ལགས།
en: “Reverend Lord, when great bodhisattva beings train accordingly, in what things do they train?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ན་ཆོས་གང་དག་ལ་ཡང་བསླབས་པ་མེད་དོ། །
en: The Blessed One replied, “Śāradvatī­putra, when great bodhisattva beings train accordingly, they do not train in anything at all.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་མངོན་པར་ཞེན་པ་དེ་ལྟར་ཆོས་འདི་དག་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: If you ask why, Śāradvatī­putra, it is because these things are non-existent in the ways that ordinary people are fixated on them.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་འདི་དག་ཇི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་མངོན་པར་ཞེན་པ་དེ་ལྟར་མ་མཆིས་པ་ལགས།
en: “Reverend Lord, how is it that these things are non-existent in the ways that ordinary people are fixated on them?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཇི་ལྟར་མེད་པ་དེ་ལྟར་ཡོད་ལ། དེ་ལྟར་མེད་པས་མ་རིག་པ་ཞེས་བྱའོ། །
en: The Blessed One replied, “They exist to the extent that they do not exist, and accordingly, since they do not exist, [their posited existence] is called fundamental ignorance.”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་དེ་དག་མཆིས་པ་མ་ལགས་པ་ལ་མ་རིག་པ་ཞེས་བགྱི་ལགས།
en: “Reverend Lord,” he asked, “why are these things that do not exist called fundamental ignorance?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་གཟུགས་མེད་དོ། །
en: The Blessed One replied, “Śāradvatī­putra, it is owing to the emptiness of internal phenomena, and to the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, that physical forms are non-existent.

source: དེ་བཞིན་དུ་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མེད་དོ། །
en: Similarly, it is owing to the emptiness of internal phenomena, and to the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, that feelings, perceptions, formative predispositions, and consciousness are non-existent.

source: དེ་བཞིན་དུ་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མེད་ཅིང་མི་དམིགས་སོ། །
en: Similarly, it is owing to the emptiness of internal phenomena, and to the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, that the applications of mindfulness are non-existent, and non-apprehensible.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་མེད་ན།
en: In the same vein, it is owing to the emptiness of internal phenomena, and to the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, that [the other causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are non-existent.

source: དེ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་མ་རིག་པ་དང་སྲེད་པའི་དབང་གིས་མངོན་པར་ཞེན་པ་དེ་དག་གིས་མངོན་པར་ཞེན་ནས་ཡོད་པ་མ་ཡིན་པ་ལ་ཡོད་པར་བརྟགས་སོ། །དེ་དག་ནི་འདི་ལྟ་སྟེ།
en: However, ordinary people, through their fixations due to fundamental ignorance and craving, become fixated and impute that which is non-existent as existent.

source: རྟག་པ་དང་ཆད་པའི་མཐའ་གཉིས་ལ་ཆགས་པས། དེ་དག་ནི་མི་ཤེས་མི་མཐོང་བ་སྟེ། ཆོས་གང་དག་མེད་པ་དེ་དག་ལ་ཀུན་ཏུ་རྟོག་པར་བྱེད་དོ། །བརྟགས་ནས་ཀྱང་མིང་དང་གཟུགས་ལ་མངོན་པར་ཞེན་པ་ནས།
en: Through their adherence to the two extremes of eternalism and nihilism, without knowing and without seeing, they imagine those things that are non-existent, and after imputing them, they become fixated on the [psycho-physical aggregates that constitute] name and form.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་ལ་མངོན་པར་ཞེན་ཏོ། །
en: In the same vein, they become fixated on [all the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.
